; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c5-s4-p17-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 
          l0-0 l0-1 l0-2 l0-3 l1-0 l1-1 l1-2 l1-3 l2-0 l2-1 l2-2 l2-3 l3-0 l3-1 l3-2 l3-3 l4-0 l4-1 l4-2 l4-3 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (at t0 l0-1)
    (at t1 l1-0)
    (at t2 l2-1)
    (at t3 l3-0)
    (at t4 l4-2)
    (at p0 l4-3)
    (at p1 l3-2)
    (at p2 l1-0)
    (at p3 l2-0)
    (at p4 l3-0)
    (at p5 l0-0)
    (at p6 l2-1)
    (at p7 l0-2)
    (at p8 l0-0)
    (at p9 l4-3)
    (at p10 l3-3)
    (at p11 l4-3)
    (at p12 l1-1)
    (at p13 l2-0)
    (at p14 l4-1)
    (at p15 l0-2)
    (at p16 l1-0)
    (at a0 l3-0)
    (at a1 l2-0)
)
(:goal
    (and
        (at p0 l4-3)
        (at p1 l3-2)
        (at p2 l0-1)
        (at p3 l1-0)
        (at p4 l2-0)
        (at p5 l0-1)
        (at p6 l0-3)
        (at p7 l1-1)
        (at p8 l2-3)
        (at p9 l2-2)
        (at p10 l1-0)
        (at p11 l3-3)
        (at p12 l0-3)
        (at p13 l4-2)
        (at p14 l4-1)
        (at p15 l1-1)
        (at p16 l2-3)
    )
)

  (:constraints
    (and
      (always (not (in p0 a0)))
      (always (not (in p0 a1)))
      (always (not (in p1 a0)))
      (always (not (in p1 a1)))
      (always (not (in p14 a0)))
      (always (not (in p14 a1)))
      (always (not (in p5 a0)))
      (always (not (in p5 a1)))
    )
  )
)

; plan
1. (fly-airplane a1 l2-0 l4-0)
   deleted: (at a1 l2-0)
   added: (at a1 l4-0)
   goals met: 3 of 17
2. (load-airplane p4 a0 l3-0)
   deleted: (at p4 l3-0)
   added: (in p4 a0)
   goals met: 3 of 17
3. (load-truck p6 t2 l2-1)
   deleted: (at p6 l2-1)
   added: (in p6 t2)
   goals met: 3 of 17
4. (drive-truck t4 l4-2 l4-3 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-3)
   goals met: 3 of 17
5. (drive-truck t3 l3-0 l3-3 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-3)
   goals met: 3 of 17
6. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 3 of 17
7. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 3 of 17
8. (drive-truck t2 l2-1 l2-3 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-3)
   goals met: 3 of 17
9. (load-truck p9 t4 l4-3)
   deleted: (at p9 l4-3)
   added: (in p9 t4)
   goals met: 3 of 17
10. (load-truck p11 t4 l4-3)
   deleted: (at p11 l4-3)
   added: (in p11 t4)
   goals met: 3 of 17
11. (load-truck p10 t3 l3-3)
   deleted: (at p10 l3-3)
   added: (in p10 t3)
   goals met: 3 of 17
12. (load-truck p12 t1 l1-1)
   deleted: (at p12 l1-1)
   added: (in p12 t1)
   goals met: 3 of 17
13. (load-truck p7 t0 l0-2)
   deleted: (at p7 l0-2)
   added: (in p7 t0)
   goals met: 3 of 17
14. (load-truck p15 t0 l0-2)
   deleted: (at p15 l0-2)
   added: (in p15 t0)
   goals met: 3 of 17
15. (drive-truck t4 l4-3 l4-0 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-0)
   goals met: 3 of 17
16. (drive-truck t0 l0-2 l0-3 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-3)
   goals met: 3 of 17
17. (drive-truck t3 l3-3 l3-0 c3)
   deleted: (at t3 l3-3)
   added: (at t3 l3-0)
   goals met: 3 of 17
18. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 3 of 17
19. (drive-truck t2 l2-3 l2-0 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-0)
   goals met: 3 of 17
20. (unload-truck p9 t4 l4-0)
   deleted: (in p9 t4)
   added: (at p9 l4-0)
   goals met: 3 of 17
21. (unload-truck p11 t4 l4-0)
   deleted: (in p11 t4)
   added: (at p11 l4-0)
   goals met: 3 of 17
22. (unload-truck p10 t3 l3-0)
   deleted: (in p10 t3)
   added: (at p10 l3-0)
   goals met: 3 of 17
23. (unload-truck p12 t1 l1-0)
   deleted: (in p12 t1)
   added: (at p12 l1-0)
   goals met: 3 of 17
24. (unload-truck p6 t2 l2-0)
   deleted: (in p6 t2)
   added: (at p6 l2-0)
   goals met: 3 of 17
25. (drive-truck t0 l0-3 l0-0 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-0)
   goals met: 3 of 17
26. (load-airplane p10 a0 l3-0)
   deleted: (at p10 l3-0)
   added: (in p10 a0)
   goals met: 3 of 17
27. (unload-truck p7 t0 l0-0)
   deleted: (in p7 t0)
   added: (at p7 l0-0)
   goals met: 3 of 17
28. (unload-truck p15 t0 l0-0)
   deleted: (in p15 t0)
   added: (at p15 l0-0)
   goals met: 3 of 17
29. (load-truck p5 t0 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 t0)
   goals met: 3 of 17
30. (load-airplane p9 a1 l4-0)
   deleted: (at p9 l4-0)
   added: (in p9 a1)
   goals met: 3 of 17
31. (load-airplane p11 a1 l4-0)
   deleted: (at p11 l4-0)
   added: (in p11 a1)
   goals met: 3 of 17
32. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 3 of 17
33. (fly-airplane a0 l3-0 l2-0)
   deleted: (at a0 l3-0)
   added: (at a0 l2-0)
   goals met: 3 of 17
34. (fly-airplane a1 l4-0 l3-0)
   deleted: (at a1 l4-0)
   added: (at a1 l3-0)
   goals met: 3 of 17
35. (unload-truck p5 t0 l0-1)
   deleted: (in p5 t0)
   added: (at p5 l0-1)
   goals met: 4 of 17
36. (unload-airplane p11 a1 l3-0)
   deleted: (in p11 a1)
   added: (at p11 l3-0)
   goals met: 4 of 17
37. (unload-airplane p4 a0 l2-0)
   deleted: (in p4 a0)
   added: (at p4 l2-0)
   goals met: 5 of 17
38. (load-airplane p6 a0 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 a0)
   goals met: 5 of 17
39. (load-airplane p3 a0 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 a0)
   goals met: 5 of 17
40. (load-airplane p13 a0 l2-0)
   deleted: (at p13 l2-0)
   added: (in p13 a0)
   goals met: 5 of 17
41. (fly-airplane a1 l3-0 l2-0)
   deleted: (at a1 l3-0)
   added: (at a1 l2-0)
   goals met: 5 of 17
42. (load-truck p11 t3 l3-0)
   deleted: (at p11 l3-0)
   added: (in p11 t3)
   goals met: 5 of 17
43. (fly-airplane a0 l2-0 l4-0)
   deleted: (at a0 l2-0)
   added: (at a0 l4-0)
   goals met: 5 of 17
44. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 5 of 17
45. (drive-truck t3 l3-0 l3-3 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-3)
   goals met: 5 of 17
46. (unload-airplane p9 a1 l2-0)
   deleted: (in p9 a1)
   added: (at p9 l2-0)
   goals met: 5 of 17
47. (unload-airplane p13 a0 l4-0)
   deleted: (in p13 a0)
   added: (at p13 l4-0)
   goals met: 5 of 17
48. (unload-truck p11 t3 l3-3)
   deleted: (in p11 t3)
   added: (at p11 l3-3)
   goals met: 6 of 17
49. (load-truck p9 t2 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 t2)
   goals met: 6 of 17
50. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 6 of 17
51. (fly-airplane a0 l4-0 l1-0)
   deleted: (at a0 l4-0)
   added: (at a0 l1-0)
   goals met: 6 of 17
52. (load-truck p13 t4 l4-0)
   deleted: (at p13 l4-0)
   added: (in p13 t4)
   goals met: 6 of 17
53. (unload-airplane p3 a0 l1-0)
   deleted: (in p3 a0)
   added: (at p3 l1-0)
   goals met: 7 of 17
54. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 7 of 17
55. (drive-truck t4 l4-0 l4-2 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-2)
   goals met: 7 of 17
56. (unload-airplane p10 a0 l1-0)
   deleted: (in p10 a0)
   added: (at p10 l1-0)
   goals met: 8 of 17
57. (load-airplane p2 a0 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 8 of 17
58. (load-airplane p16 a0 l1-0)
   deleted: (at p16 l1-0)
   added: (in p16 a0)
   goals met: 8 of 17
59. (load-airplane p12 a0 l1-0)
   deleted: (at p12 l1-0)
   added: (in p12 a0)
   goals met: 8 of 17
60. (fly-airplane a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 8 of 17
61. (unload-truck p9 t2 l2-2)
   deleted: (in p9 t2)
   added: (at p9 l2-2)
   goals met: 9 of 17
62. (unload-truck p13 t4 l4-2)
   deleted: (in p13 t4)
   added: (at p13 l4-2)
   goals met: 10 of 17
63. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 10 of 17
64. (load-airplane p8 a1 l0-0)
   deleted: (at p8 l0-0)
   added: (in p8 a1)
   goals met: 10 of 17
65. (load-airplane p7 a1 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 a1)
   goals met: 10 of 17
66. (load-airplane p15 a1 l0-0)
   deleted: (at p15 l0-0)
   added: (in p15 a1)
   goals met: 10 of 17
67. (drive-truck t2 l2-2 l2-3 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-3)
   goals met: 10 of 17
68. (unload-airplane p16 a0 l2-0)
   deleted: (in p16 a0)
   added: (at p16 l2-0)
   goals met: 10 of 17
69. (fly-airplane a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 10 of 17
70. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 10 of 17
71. (unload-airplane p7 a1 l1-0)
   deleted: (in p7 a1)
   added: (at p7 l1-0)
   goals met: 10 of 17
72. (unload-airplane p15 a1 l1-0)
   deleted: (in p15 a1)
   added: (at p15 l1-0)
   goals met: 10 of 17
73. (drive-truck t2 l2-3 l2-0 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-0)
   goals met: 10 of 17
74. (load-truck p7 t1 l1-0)
   deleted: (at p7 l1-0)
   added: (in p7 t1)
   goals met: 10 of 17
75. (unload-airplane p6 a0 l0-0)
   deleted: (in p6 a0)
   added: (at p6 l0-0)
   goals met: 10 of 17
76. (unload-airplane p2 a0 l0-0)
   deleted: (in p2 a0)
   added: (at p2 l0-0)
   goals met: 10 of 17
77. (unload-airplane p12 a0 l0-0)
   deleted: (in p12 a0)
   added: (at p12 l0-0)
   goals met: 10 of 17
78. (fly-airplane a1 l1-0 l2-0)
   deleted: (at a1 l1-0)
   added: (at a1 l2-0)
   goals met: 10 of 17
79. (load-truck p15 t1 l1-0)
   deleted: (at p15 l1-0)
   added: (in p15 t1)
   goals met: 10 of 17
80. (load-truck p16 t2 l2-0)
   deleted: (at p16 l2-0)
   added: (in p16 t2)
   goals met: 10 of 17
81. (load-truck p6 t0 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 t0)
   goals met: 10 of 17
82. (load-truck p2 t0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 t0)
   goals met: 10 of 17
83. (load-truck p12 t0 l0-0)
   deleted: (at p12 l0-0)
   added: (in p12 t0)
   goals met: 10 of 17
84. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 10 of 17
85. (unload-airplane p8 a1 l2-0)
   deleted: (in p8 a1)
   added: (at p8 l2-0)
   goals met: 10 of 17
86. (drive-truck t0 l0-0 l0-3 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 10 of 17
87. (unload-truck p7 t1 l1-1)
   deleted: (in p7 t1)
   added: (at p7 l1-1)
   goals met: 11 of 17
88. (unload-truck p15 t1 l1-1)
   deleted: (in p15 t1)
   added: (at p15 l1-1)
   goals met: 12 of 17
89. (load-truck p8 t2 l2-0)
   deleted: (at p8 l2-0)
   added: (in p8 t2)
   goals met: 12 of 17
90. (unload-truck p6 t0 l0-3)
   deleted: (in p6 t0)
   added: (at p6 l0-3)
   goals met: 13 of 17
91. (unload-truck p12 t0 l0-3)
   deleted: (in p12 t0)
   added: (at p12 l0-3)
   goals met: 14 of 17
92. (drive-truck t2 l2-0 l2-3 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-3)
   goals met: 14 of 17
93. (unload-truck p8 t2 l2-3)
   deleted: (in p8 t2)
   added: (at p8 l2-3)
   goals met: 15 of 17
94. (unload-truck p16 t2 l2-3)
   deleted: (in p16 t2)
   added: (at p16 l2-3)
   goals met: 16 of 17
95. (drive-truck t0 l0-3 l0-1 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-1)
   goals met: 16 of 17
96. (unload-truck p2 t0 l0-1)
   deleted: (in p2 t0)
   added: (at p2 l0-1)
   goals met: 17 of 17
